-- Добавление новых активностей из справочника
-- Поля: zoneId, activityBarcode, fullName, shortName, metric

INSERT INTO [dbo].[Activities] (zoneId, activityBarcode, fullName, shortName, metric)
VALUES 
-- ТЕРМИНАЛ-3
(N'ТЕРМИНАЛ-3', N'ТЗК', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. отбора Терминал 3_помощь на участке Т3_оператор складской логистики_1L1', N'ТЗК-Комплектация', N'000001084'),
(N'ТЕРМИНАЛ-3', N'ТЗКарт', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. отбора Терминал 3_помощь на участке Т3_оператор складской логистики_1L1', N'ТЗКарт-Картонажные машины', N'000001084'),
(N'ТЕРМИНАЛ-3', N'ТЗУ', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. отбора Терминал 3_склад Т3_оператор складской логистики_1L1', N'ТЗУ-Укладка', N'000001070'),
(N'ТЕРМИНАЛ-3', N'ТЗКор', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. отбора Терминал 3_комплектовщик_1L1', N'ТЗКор-Коробочная комплектация', N'000001069'),
(N'ТЕРМИНАЛ-3', N'ТЗП', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. отбора Терминал 3_склад Т3_оператор складской логистики_1L1', N'ТЗП-Комплектация однострочных пакетов', N'000001070'),

-- ТЕРМИНАЛ-2
(N'ТЕРМИНАЛ-2', N'Т2К', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. отбора Терминал 2_помощь на участке Т2_оператор складской логистики_1L1', N'Т2К-Комплектация', N'000001056'),
(N'ТЕРМИНАЛ-2', N'Т2П', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. отбора Терминал 2_склад Т2_оператор складской логистики_1L1', N'Т2П-Комплектация однострочных пакетов', N'000001044'),
(N'ТЕРМИНАЛ-2', N'Т2С', N'РЦ Домодедово_Напр. сортировки/упаковки Терминал 2_помощь на участке_оператор складской логистики_1L1', N'Т2С-Сортировка', N'000001061'),
(N'ТЕРМИНАЛ-2', N'Т2У', N'РЦ Домодедово_Напр. сортировки/упаковки Терминал 2_помощь на участке_оператор складской логистики_1L1', N'Т2У-Упаковка', N'000001061'),

-- МЕЗОНИН
(N'МЕЗОНИН', N'МК', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. обработки внутренних ошибок и комплектации дорогого товара_контролер комплектации_1L1', N'МК-Контроль', N'000001039'),
(N'МЕЗОНИН', N'МП', N'РЦ Домодедово_Напр. Комплектация заказов_Гр. обработки пакетов и оборотной тары_помощь_оператор складской логистики_1L1', N'МП-Участок пакетики', N'000001030'),
(N'МЕЗОНИН', N'МДТС', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. обработки внутренних ошибок и комплектации дорогого товара_помощь_оператор складской логистики_1L1', N'МДТС-Сортировка дорогого товара', N'000001040'),
(N'МЕЗОНИН', N'МДТУ', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. обработки внутренних ошибок и комплектации дорогого товара_оператор складской логистики_1L1', N'МДТУ-Укладка дорогого товара', N'000001037'),
(N'МЕЗОНИН', N'МВК', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. обработки внутренних ошибок и комплектации дорогого товара_помощь_оператор складской логистики_1L1', N'МВК-Комплектация возвратов', N'000001040'),
(N'МЕЗОНИН', N'МВУ', N'РЦ Домодедово_Напр. Комплектация заказов_Бриг. обработки внутренних ошибок и комплектации дорогого товара_помощь_оператор складской логистики_1L1', N'МВУ-Укладка возвратов', N'000001040'),

-- БАЛК
(N'БАЛК', N'Балк-IFD', N'РЦ Домодедово_Напр. комплектации Балк_IFD_комплектовщик_1L1', N'Балк-Комплектация IFD', N'000001024'),
(N'БАЛК', N'Балк-КК', N'РЦ Домодедово_Напр. комплектации Балк_KK_комплектовщик_1L1', N'Балк-Комплектация СПО КК', N'000001026'),
(N'БАЛК', N'Балк-ШК', N'РЦ Домодедово_Напр. комплектации Балк_ШК_комплектовщик_1L1', N'Балк-Комплектация СПО ШК', N'000001023');
GO
